//
//Домашнее задание Калинцев Ю.М.
//16/09/2021
//

#include <iostream>
#include <fstream>
#include <cstdlib>
#include <string>
using namespace std;


//=====================================================================================================================
//1.   Выделить в памяти динамический одномерный массив типа int. Размер массива запросить у пользователя.
//Инициализировать его числами степенями двойки: 1, 2, 4, 8, 16, 32, 64, 128 … Вывести массив на экран. Не забыть
//освободить память. =) Разбить программу на функции.
//=====================================================================================================================

inline int multiply(int x){
    return x *= 2;
}

void task_1(){
    size_t size;
    cout << "indicate array size: ";
    cin >> size;

    int *ptr = new int [size];
    if(ptr != nullptr){ // пишет что условие будет всегда true и соответственно не нужно
        for(int i = 0, j = 1; i < size; i++) {
            ptr[i] = j;
            cout << ptr[i] << " ";
            j = multiply(j);
        }
        delete [] ptr;
    }
    else {
        cout << "memory not available";
    }
}

//=====================================================================================================================
//2.Динамически выделить матрицу 4х4 типа int. Инициализировать ее псевдослучайными числами через функцию rand.
// Вывести на экран. Разбейте вашу программу на функции которые вызываются из main.
//=====================================================================================================================
inline int randomize(){
    int x = rand() % 100;
    return x;
}

void task_2(){
    int **pparr = new int* [4];
    for (int i=0; i<4; i++)
    {
        pparr[i] = new int [4];
        for(int j=0;j<4;j++)
        {
            pparr[i][j] = randomize();
            cout << pparr[i][j] << " ";
        }
        cout << endl;
    }
    delete[] pparr;
}

//=====================================================================================================================
//3. Написать программу, которая создаст два текстовых файла (*.txt), примерно по 50-100 символов в каждом
//(особого значения не имеет с каким именно содержимым). Имена файлов запросить у польлзователя.
//=====================================================================================================================


void task_3(){
    string name;
    for (int k = 1; k<3; ++k) {
        cout << "name file_" << k << ": ";
        cin >> name;
        name += ".txt";
        char n;
        ofstream file(name);
        if(k==2) {
            for (int i = 0; i < 10; i++) {
                for (int j = 0; j < 10; j++) {
                    n = 92;

                    file << n;
                }
                file << "\n";
            }
        }
        else{
            for (int i = 0; i < 10; i++) {
                for (int j = 0; j < 10; j++) {
                    n = 47;
                    file << n;
                }
                file << "\n";
            }
        }
        file.close();
    }
}

//=====================================================================================================================
//4. * Написать функцию, «склеивающую» эти файлы в третий текстовый файл (имя файлов спросить у пользователя).
//=====================================================================================================================
void task_4(string x, string y, string xy){
    fstream file_1(x);
    fstream file_2(y);
    ofstream file_3(xy);
    if (file_1.is_open() && file_2.is_open() && file_3.is_open())
    {
        string buf_1, buf_2, buf_3;
        while (!file_1.eof())
        {
            getline(file_1, buf_1);
            getline(file_2, buf_2);
            buf_3 = buf_1 + buf_2 + "\n";
            file_3 << buf_3;
            cout << buf_3 << endl;
        }
        file_1.close();
        file_2.close();
        file_3.close();
    }

}

//=====================================================================================================================
//5. в отдельной срр
//=====================================================================================================================

int main(){
    srand(time(0));

    task_1();
    task_2();
    task_3();

    // task_4
    string name_1, name_2, name_3;
    cout << "please indicate the files to merge \nand name the new file\n";
    cout << "1.:  ";
    cin >> name_1;
    cout << "2.:  ";
    cin >> name_2;
    cout << "new file name: ";
    cin >> name_3;
    name_1 += ".txt";
    name_2 += ".txt";
    name_3 += ".txt";
    task_4(name_1, name_2, name_3);

    return 0;

}
